In [7]:
import numpy as np
import pandas as pd

import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.482226  0.771421
1    a  two  2.712093 -1.741021
2    b  one -0.019779 -0.514984
3    b  two -0.205330  0.004440
4    a  one  0.651569  0.055013

In [4]:
df.groupby(by=['key1','key2']).sum()

              data1     data2
key1 key2
a    one   0.582243 -0.254387
     two  -0.368796 -0.527091
b    one   0.995812  1.295896
     two  -1.254173  1.343480

In [5]:
df[['key1','data1','data2']].groupby(by='key1').sum()

         data1     data2
key1
a     0.213448 -0.781479
b    -0.258361  2.639376

In [6]:
df[['key2','data1','data2']].groupby(by='key2').sum()

         data1     data2
key2
one   1.578055  1.041509
two  -1.622969  0.816388